import React from 'react';
import './index.css';
import {Link} from "react-router-dom";

function AboutPage() {
  return (
    <div className="about-page">
      <header className="about-header">
        <h1>О нас</h1>
        <p>БиоНур — это натуральные сухофрукты, созданные с заботой о вашем здоровье.

Мы — команда, которая объединяет опыт, любовь к природе и современные технологии, чтобы вы могли наслаждаться вкусом лета круглый год. Наша компания занимается производством высококачественных сухофруктов из отборных фруктов, выращенных в экологически чистых регионах.

Мы не используем добавки, сахар и консерванты — только 100% натуральный продукт, сохранивший всю пользу и вкус свежих фруктов. Каждый этап — от сбора урожая до упаковки — проходит строгий контроль качества, чтобы вы получали только лучшее.

Наша миссия — сделать здоровое питание доступным и вкусным. Мы верим, что натуральные продукты — это основа долгой и активной жизни. Именно поэтому мы с особой тщательностью подходим к каждому процессу, чтобы предложить вам то, чем мы гордимся.

Присоединяйтесь к тем, кто выбирает качество, заботу и натуральность — выберите БиоНур</p>
      </header>

      <section className="team-section">
        <h2>Наша команда</h2>
        <p>
          Мы — группа опытных специалистов, объединённых страстью к технологиям и стремлением делать качественные цифровые продукты.
        </p>
        <div className="team-members">
          <div className="team-member">
            <Link to="/contact/Anna"><img src="/images/woman1.jpg" alt="Member 1" /></Link>

            <h3>Исираев Бектемир</h3>

            <p>Директор</p>
          </div>
          <div className="team-member">
            <Link to="/contact/Igor"><img src="/images/woman1.jpg" alt="Member 2" /></Link>
            <h3>Сарыбаева Салтанат</h3>
            <p>Зам директор</p>
          </div>
          <div className="team-member">
            <Link to="/contact/Maria"><img src="/images/woman1.jpg" alt="Member 3" /></Link>
            <h3>Абдирашитов Мирланбек</h3>
            <p>Менеджер</p>
          </div>
        </div>
      </section>

      <section className="mission-section">
        <h2>Наша миссия</h2>
        <p>
          Помогать бизнесу развиваться с помощью современных технологий. Мы верим в долгосрочные отношения, прозрачность и инновации.
        </p>
      </section>

      <footer className="footer">
        <p>© 2025 МояКомпания. Все права защищены.</p>
      </footer>
    </div>
  );
}

export default AboutPage;
